In [1]:
import pandas as pd

In [2]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

In [3]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [4]:
departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [5]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [7]:
pd.merge(employees, departments , on = "DeptID")#inner join

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [8]:
pd.merge(employees, departments , on = "DeptID" , how = "left")#left join

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [9]:
pd.merge(employees, departments , on = "DeptID", how = "right")#right join

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [10]:
pd.merge(employees, departments , on = "DeptID", how = "outer")

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [13]:
df1 = pd.DataFrame({ "Name" : ["Rutuja", "Anuj", "Yukta" , "Sumit"] ,
                    "Roll no" : [12, 13, 14, 15]})
df2 = pd.DataFrame({ "Name" : ["Disha" , "Tanmay"],
                    "Roll no" : [15,16]})

In [14]:
df1

     Name  Roll no
0  Rutuja       12
1    Anuj       13
2   Yukta       14
3   Sumit       15

In [15]:
df2

     Name  Roll no
0   Disha       15
1  Tanmay       16

In [17]:
pd.concat([df1,df2]) ##here by default axis is 0 always

     Name  Roll no
0  Rutuja       12
1    Anuj       13
2   Yukta       14
3   Sumit       15
0   Disha       15
1  Tanmay       16

In [18]:
pd.concat([df1,df2] , axis = 1)

     Name  Roll no    Name  Roll no
0  Rutuja       12   Disha     15.0
1    Anuj       13  Tanmay     16.0
2   Yukta       14     NaN      NaN
3   Sumit       15     NaN      NaN